app/views/communal_items/_issue.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
@<%= issue.user.first_name %> - <%= issue.reason %>