app/controllers/chores_controller.rb

SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT  "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1 AND "housing_assignments"."user_id" = $2 LIMIT 1  [["house_id", 1], ["user_id", 1]]
SELECT "chores".* FROM "chores" WHERE "chores"."house_id" = $1  [["house_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "housing_assignments" ON "users"."id" = "housing_assignments"."user_id" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @house = House.find(params[:house_id])
    if @user = current_user
      @user_house = @user.houses.first
      if @user_house == @house
        @chores = @house.chores
        @users = @house.users
        @housing_assignment = HousingAssignment.find_by(house_id: @house.id, user_id: @user.id)
        @chore_logs = @house.users.map {|user| user.chore_logs}