app/controllers/communal_items_controller.rb

  def index
    @house = House.find(params[:house_id])
    if @user = current_user
      if @user.houses.first == @house
          @items = @house.communal_items
          @stock_levels = ["high","low","out"]
           @items_out = @items.select {|i| i.stock_level == "out"}
---
SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "communal_items".* FROM "communal_items" WHERE "communal_items"."house_id" = $1  [["house_id", 1]]

  def low
    if @user = current_user
      @house = House.find(params[:house_id])
      @item = CommunalItem.find(params[:id])
      @item.stock_level = "low"
      @item.save
---
SELECT  "communal_items".* FROM "communal_items" WHERE "communal_items"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "communal_items" SET "stock_level" = $1, "updated_at" = $2 WHERE "communal_items"."id" = $3  [["stock_level", "low"], ["updated_at", "2015-05-13 20:32:55.870345"], ["id", 1]]