app/controllers/events_controller.rb

  def index
    @house = House.find(params[:house_id])
    @event = Event.new
    if @user = current_user
      if @user.houses.first == @house
---
SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 1]]

  def create
    @user = current_user
    @house = House.find(params[:house_id])
    @event = @house.events.new(event_params)
    @event.save
    @notification = Notification.create(alert: "#{current_user.first_name} has added #{@event.title} to Events.", category: "events", house_id: @house.id)
        HousingAssignment.where(house_id: @house.id).select do |assignment|
---
INSERT INTO "events" ("title", "all_day", "overlap", "description", "start", "end", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "notifications" ("alert", "category", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["alert", "Paul has added Testing again to Events."], ["category", "events"], ["house_id", 1], ["created_at", "2015-05-14 18:40:15.531594"], ["updated_at", "2015-05-14 18:40:15.531594"]]
SELECT "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]

  def edit
    @user = current_user
    @house = House.find(params[:house_id])
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @event = Event.find(params[:id])
    @house = House.find(params[:house_id])
    if request.xhr?
      @event.update_attributes(event_params)
      @notification = Notification.create(alert: "#{current_user.first_name} has updated #{@event.title}", category: "events", house_id: @house.id)
      HousingAssignment.where(house_id: @house.id).select do |assignment|
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 35]]
UPDATE "events" SET "title" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["title", "my PARTY!!!!"], ["updated_at", "2015-05-15 16:11:30.071160"], ["id", 35]]
INSERT INTO "notifications" ("alert", "category", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["alert", "Paul has updated my PARTY!!!!"], ["category", "events"], ["house_id", 1], ["created_at", "2015-05-15 16:12:05.302642"], ["updated_at", "2015-05-15 16:12:05.302642"]]
SELECT "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]

  def destroy
    @event = Event.find(params[:id])
    @house = House.find(params[:house_id])
    if request.xhr?
      @event.destroy
      @notification = Notification.create(alert: "#{current_user.first_name} has deleted #{@event.title}.", category: "events", house_id: @house.id)
      HousingAssignment.where(house_id: @house.id).select do |assignment|
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]
INSERT INTO "notifications" ("alert", "category", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["alert", "Paul has deleted poop."], ["category", "events"], ["house_id", 1], ["created_at", "2015-05-14 20:42:09.281148"], ["updated_at", "2015-05-14 20:42:09.281148"]]
SELECT "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]