app/controllers/houses_controller.rb

  def show
    @user = current_user
    @current_house = @user.houses.first
    @house = House.find_by(id: params[:id])
    @address = @house.address
    if HousingAssignment.find_by(user_id: @user.id, house_id: @house.id)
---
SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT  "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."user_id" = $1 AND "housing_assignments"."house_id" = $2 LIMIT 1  [["user_id", 1], ["house_id", 1]]