app/controllers/messages_controller.rb

  def index
    @house = House.find(params[:house_id])
    if @user = current_user
      if @user.houses.first == @house
        @messages = @house.messages.to_a.reverse!
---
SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."house_id" = $1 AND (created_at >= '2015-05-13 00:00:00.000000')  [["house_id", 1]]

  def destroy
    if @user = current_user
      @house = House.find(params[:house_id])
      @message = Message.find(params[:id])
      if request.xhr?
        @message.destroy
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 1]]