app/controllers/rules_controller.rb

  def index
    @house = House.find_by(id: params[:house_id])
    if @user = current_user
      @user_house = @user.houses.first
---
SELECT  "houses".* FROM "houses" INNER JOIN "housing_assignments" ON "houses"."id" = "housing_assignments"."house_id" WHERE "housing_assignments"."user_id" = $1  ORDER BY "houses"."id" ASC LIMIT 1  [["user_id", 1]]

  def create
    @user = current_user
    @house = House.find(params[:house_id])
    @rule = @house.rules.new(rule_params)
    @rule.save
    @notification = Notification.create(alert: "#{current_user.first_name} has added #{@rule.content} to the house rules.", category: "rules", house_id: @house.id)
    HousingAssignment.where(house_id: @house.id).select do |assignment|
---
INSERT INTO "rules" ("content", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "testingggggg"], ["house_id", 1], ["created_at", "2015-05-14 18:46:55.846892"], ["updated_at", "2015-05-14 18:46:55.846892"]]
INSERT INTO "notifications" ("alert", "category", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["alert", "Paul has added testingggggg to the house rules."], ["category", "rules"], ["house_id", 1], ["created_at", "2015-05-14 18:46:55.876289"], ["updated_at", "2015-05-14 18:46:55.876289"]]
SELECT "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]

  def update
    @user = current_user
    @house = House.find(params[:house_id])
    @rule = Rule.find(params[:id])
    if @rule.update_attributes(rule_params)
      @notification = Notification.create(alert: "#{current_user.first_name} has updated #{@rule.content}.", category: "rules", house_id: @house.id)
      HousingAssignment.where(house_id: @house.id).select do |assignment|
---
SELECT  "rules".* FROM "rules" WHERE "rules"."id" = $1 LIMIT 1  [["id", 39]]
UPDATE "rules" SET "content" = $1, "updated_at" = $2 WHERE "rules"."id" = $3  [["content", ",djkdjjdkljxclkjxzlchhhh"], ["updated_at", "2015-05-15 17:43:33.305131"], ["id", 39]]
INSERT INTO "notifications" ("alert", "category", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["alert", "Paul has updated ,djkdjjdkljxclkjxzlchhhh."], ["category", "rules"], ["house_id", 1], ["created_at", "2015-05-15 17:43:33.309975"], ["updated_at", "2015-05-15 17:43:33.309975"]]
SELECT "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]

  def destroy
    if @user = current_user
      @house = House.find(params[:house_id])
      @rule = Rule.find_by(id: params[:id])
      if request.xhr?
        @rule.destroy
        @notification = Notification.create(alert: "#{current_user.first_name} has deleted #{@rule.content}.", category: "rules", house_id: @house.id)
        HousingAssignment.where(house_id: @house.id).select do |assignment|
---
SELECT  "rules".* FROM "rules" WHERE "rules"."id" = $1 LIMIT 1  [["id", 28]]
DELETE FROM "rules" WHERE "rules"."id" = $1  [["id", 28]]
INSERT INTO "notifications" ("alert", "category", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["alert", "Paul has deleted vcxkvjclxvjclx."], ["category", "rules"], ["house_id", 1], ["created_at", "2015-05-14 18:45:21.787811"], ["updated_at", "2015-05-14 18:45:21.787811"]]
SELECT "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]