app/controllers/user_promises_controller.rb

  def create
    if @user = current_user
      @house = House.find_by(id: params[:house_id])
      @item = CommunalItem.find_by(id: params[:communal_item_id])
      @item.user_promise = UserPromise.create(user_id: @user.id)
      @notification = Notification.create(alert: "#{current_user.first_name} will get the next #{@item.name}.", category: "communal_items", house_id: @house.id)
      HousingAssignment.where(house_id: @house.id).select do |assignment|
---
SELECT  "communal_items".* FROM "communal_items" WHERE "communal_items"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "user_promises" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2015-05-13 20:32:59.337727"], ["updated_at", "2015-05-13 20:32:59.337727"]]
INSERT INTO "notifications" ("alert", "category", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["alert", "Paul will get the next toilet paper."], ["category", "communal_items"], ["house_id", 1], ["created_at", "2015-05-13 20:32:59.347955"], ["updated_at", "2015-05-13 20:32:59.347955"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]

  def update
    if @user = current_user
      @house = House.find_by(id: params[:house_id])
      @item = CommunalItem.find_by(id: params[:communal_item_id])
      @item.stock_level = "high"
      @item.save
      @promise = @item.user_promise
      @promise.destroy
      @notification = Notification.create(alert: "#{current_user.first_name} got #{@item.name} and it is in stock.", category: "communal_items", house_id: @house.id)
      HousingAssignment.where(house_id: @house.id).select do |assignment|
---
SELECT  "communal_items".* FROM "communal_items" WHERE "communal_items"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "communal_items" SET "stock_level" = $1, "updated_at" = $2 WHERE "communal_items"."id" = $3  [["stock_level", "high"], ["updated_at", "2015-05-13 20:32:51.435622"], ["id", 1]]
DELETE FROM "user_promises" WHERE "user_promises"."id" = $1  [["id", 2]]
INSERT INTO "notifications" ("alert", "category", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["alert", "Paul got toilet paper and it is in stock."], ["category", "communal_items"], ["house_id", 1], ["created_at", "2015-05-13 20:32:51.473344"], ["updated_at", "2015-05-13 20:32:51.473344"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "housing_assignments".* FROM "housing_assignments" WHERE "housing_assignments"."house_id" = $1  [["house_id", 1]]